# Robbie Tovar
## week 13 - 11/12/24 - 11/14
### python - panada dtataframe processing

In [1]:
import numpy as np
from pandas import *
import pandas as pd

In [2]:
#drop entries
df = DataFrame(np.arange(16).reshape(4,4),
               index = ['Ohio','Colorado','utah','New York'],
               columns = ['one','two','three','four'])
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
utah        8    9     10    11
New York   12   13     14    15

In [3]:
df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [4]:
df.index

Index(['Ohio', 'Colorado', 'utah', 'New York'], dtype='object')

In [5]:
df.columns

Index(['one', 'two', 'three', 'four'], dtype='object')

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Ohio to New York
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     4 non-null      int32
 1   two     4 non-null      int32
 2   three   4 non-null      int32
 3   four    4 non-null      int32
dtypes: int32(4)
memory usage: 96.0+ bytes

In [7]:
df.describe()

             one        two      three       four
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [8]:
df1=df.copy()
df1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
utah        8    9     10    11
New York   12   13     14    15

In [9]:
df.drop(['Colorado'])

          one  two  three  four
Ohio        0    1      2     3
utah        8    9     10    11
New York   12   13     14    15

In [10]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
utah        8    9     10    11
New York   12   13     14    15

In [11]:
df.drop(['Ohio','utah'])

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [12]:
df.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
utah        8     10    11
New York   12     14    15

In [13]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
utah        8    9     10    11
New York   12   13     14    15

In [14]:
df.drop(['four','two'],axis ='columns')

          one  three
Ohio        0      2
Colorado    4      6
utah        8     10
New York   12     14

In [15]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
utah        8    9     10    11
New York   12   13     14    15

In [16]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
utah        8    9     10    11
New York   12   13     14    15

In [17]:
df1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
utah        8    9     10    11
New York   12   13     14    15

In [18]:
#select entreis
df=df1

In [19]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
utah        8    9     10    11
New York   12   13     14    15

In [20]:
df['one']

Ohio         0
Colorado     4
utah         8
New York    12
Name: one, dtype: int32

In [21]:
df[:1]

      one  two  three  four
Ohio    0    1      2     3

In [22]:
df[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [23]:
df[['one','three']]

          one  three
Ohio        0      2
Colorado    4      6
utah        8     10
New York   12     14

In [24]:
df>5

            one    two  three   four
Ohio      False  False  False  False
Colorado  False  False   True   True
utah       True   True   True   True
New York   True   True   True   True

In [25]:
df.loc['Colorado','one']

4

In [26]:
df.loc['Colorado',['one','three']]

one      4
three    6
Name: Colorado, dtype: int32

In [27]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
utah        8    9     10    11
New York   12   13     14    15

In [28]:
#selecting entriesj using index, like numoy
df.iloc[0]

one      0
two      1
three    2
four     3
Name: Ohio, dtype: int32

In [29]:
df.iloc[2,[1,3]]

two      9
four    11
Name: utah, dtype: int32

In [30]:
df.iloc[:2,[2,-1]]

          three  four
Ohio          2     3
Colorado      6     7

In [31]:
df.iloc[:,-1]

Ohio         3
Colorado     7
utah        11
New York    15
Name: four, dtype: int32

In [32]:
#data alignment
df1= DataFrame(np.arange(9).reshape(3,3),
               columns = list('bcd'),
               index = ['Ohio', 'Texas', 'Colorado'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [33]:
df2= DataFrame(np.arange(12).reshape(4,3),
               columns = list('bde'),
               index = ['Utah','Texas','Ohio', 'Oregon'])
df2

        b   d   e
Utah    0   1   2
Texas   3   4   5
Ohio    6   7   8
Oregon  9  10  11

In [34]:
df1+df2

            b   c    d   e
Colorado  NaN NaN  NaN NaN
Ohio      6.0 NaN  9.0 NaN
Oregon    NaN NaN  NaN NaN
Texas     6.0 NaN  9.0 NaN
Utah      NaN NaN  NaN NaN

In [35]:
#fill the non + numver with 0 
df1.add(df2,fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      6.0  1.0   9.0   8.0
Oregon    9.0  NaN  10.0  11.0
Texas     6.0  4.0   9.0   5.0
Utah      0.0  NaN   1.0   2.0

In [36]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [37]:
df1['e'] = df1['b']+df1['d']
df1

          b  c  d   e
Ohio      0  1  2   2
Texas     3  4  5   8
Colorado  6  7  8  14

In [38]:
#operatiuons between dataframe adn series
s = df2.iloc[0]
s

b    0
d    1
e    2
Name: Utah, dtype: int32

In [39]:
type(s)

pandas.core.series.Series

In [40]:
df2

        b   d   e
Utah    0   1   2
Texas   3   4   5
Ohio    6   7   8
Oregon  9  10  11

In [41]:
df2 - s

        b  d  e
Utah    0  0  0
Texas   3  3  3
Ohio    6  6  6
Oregon  9  9  9

In [42]:
# sort and rank
df = DataFrame(np.arange(1,9).reshape(2,4)*10,
               columns = list('dabc'),
               index = ['three','one'])
df

        d   a   b   c
three  10  20  30  40
one    50  60  70  80

In [43]:
#sort index by row
df.sort_index()

        d   a   b   c
one    50  60  70  80
three  10  20  30  40

In [44]:
df.sort_index(axis=1)

        a   b   c   d
three  20  30  40  10
one    60  70  80  50

In [45]:
df.sort_index(axis=1, ascending=False)

        d   c   b   a
three  10  40  30  20
one    50  80  70  60

In [46]:
df = DataFrame({'b':[4,7,-3,2],'a':[0,-1,-3,2]})
df

   b  a
0  4  0
1  7 -1
2 -3 -3
3  2  2

In [47]:
df.sort_values(by='a')

   b  a
2 -3 -3
1  7 -1
0  4  0
3  2  2

In [48]:
#sort values by columbs a and b 
df.sort_values(by=['a','b'])

   b  a
2 -3 -3
1  7 -1
0  4  0
3  2  2

In [49]:
df = DataFrame({'b':[14,17,-13,12], 'a':[10,11,15,11]})
df

    b   a
0  14  10
1  17  11
2 -13  15
3  12  11

In [50]:
df.rank()

     b    a
0  3.0  1.0
1  4.0  2.5
2  1.0  4.0
3  2.0  2.5

In [51]:
df.rank().astype(int)

   b  a
0  3  1
1  4  2
2  1  4
3  2  2

In [52]:
#summarizng data - statisctics 
df = DataFrame([ [1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],
              index = list('abcd'),
              columns = ['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [53]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [54]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [55]:
df.mean(axis=1,skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [56]:
df.min(axis=1)

a    1.4
b   -4.5
c    NaN
d   -1.3
dtype: float64

In [57]:
df.max(axis=1)

a    1.40
b    7.10
c     NaN
d    0.75
dtype: float64

In [58]:
#idxmax() returns index of the first occurance of maximum over requested axis
df.idxmax()

one    b
two    d
dtype: object

In [59]:
import numpy as np
from pandas import *
import pandas as pd

In [60]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [61]:
#create a Dataframe representing stock prices
data ={
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04' ],
    'META': [150, 155, 148, 160],
    'TSLA': [200, 210, 295, 220],
    'GOOGL': [100, 105, 98,110]
}
df = DataFrame(data)
df.set_index('Date', inplace=True)
df

            META  TSLA  GOOGL
Date
2023-01-01   150   200    100
2023-01-02   155   210    105
2023-01-03   148   295     98
2023-01-04   160   220    110

In [62]:
# find the date with the highest closing price for each stock 
df.idxmax()

META     2023-01-04
TSLA     2023-01-03
GOOGL    2023-01-04
dtype: object

In [63]:
df.idxmin()

META     2023-01-03
TSLA     2023-01-01
GOOGL    2023-01-03
dtype: object

In [64]:
df.idxmax(axis=1)

Date
2023-01-01    TSLA
2023-01-02    TSLA
2023-01-03    TSLA
2023-01-04    TSLA
dtype: object

In [65]:
df.idxmin(axis=1)

Date
2023-01-01    GOOGL
2023-01-02    GOOGL
2023-01-03    GOOGL
2023-01-04    GOOGL
dtype: object

In [66]:
df_t = df.T
df_t

Date   2023-01-01  2023-01-02  2023-01-03  2023-01-04
META          150         155         148         160
TSLA          200         210         295         220
GOOGL         100         105          98         110

In [67]:

df_t.idxmax()

Date
2023-01-01    TSLA
2023-01-02    TSLA
2023-01-03    TSLA
2023-01-04    TSLA
dtype: object

In [68]:
#find the stock of the minimum and maximum values for a specific date 
min_stock_index = df_t['2023-01-02'].idxmin()

print(f"Stock name with minium value in 2023-01-02: {min_stock_index}")

Stock name with minium value in 2023-01-02: GOOGL

In [69]:
max_stock_index = df_t['2023-01-02'].idxmax()
print(f'Stock name with maximum value in 2023-01-02: {max_stock_index}')

Stock name with maximum value in 2023-01-02: TSLA

In [70]:
# missing data
df = DataFrame([  [1,2,3,4],  [np.nan,5.6 ], [7,np.nan,9],  [np.nan,np.nan,np.nan]])
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.6  NaN  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [71]:
#dropna
df_copy = df.copy()
df.dropna()

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [72]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [73]:
df.dropna(how='all')

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.6  NaN  NaN
2  7.0  NaN  9.0  NaN

In [74]:
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.6  NaN  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [75]:
df.dropna(how='all', axis=1)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.6  NaN  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [76]:
#keep only the rows having 2 or more valid data
df.dropna(thresh=2)

     0    1    2    3
0  1.0  2.0  3.0  4.0
2  7.0  NaN  9.0  NaN

In [77]:
df.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [78]:
df.dropna(thresh=3,axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [79]:
df.dropna(thresh=2,axis=1)

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.6  NaN
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [80]:
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.6  NaN  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [81]:
df.fillna(0)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  0.0  5.6  0.0  0.0
2  7.0  0.0  9.0  0.0
3  0.0  0.0  0.0  0.0

In [82]:
df.fillna(1)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  1.0  5.6  1.0  1.0
2  7.0  1.0  9.0  1.0
3  1.0  1.0  1.0  1.0

In [83]:
df.fillna(0,inplace=True)

In [84]:
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  0.0  5.6  0.0  0.0
2  7.0  0.0  9.0  0.0
3  0.0  0.0  0.0  0.0

In [85]:
data = {
    'CustomerID': [1001,1002,1003,10044],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, None, 27], 
    'Income': [50000, None, 70000, 60000]
}
df = DataFrame(data)
df

   CustomerID     Name   Age   Income
0        1001    Alice  25.0  50000.0
1        1002      Bob  30.0      NaN
2        1003  Charlie   NaN  70000.0
3       10044    David  27.0  60000.0

In [86]:
df.fillna(0)

   CustomerID     Name   Age   Income
0        1001    Alice  25.0  50000.0
1        1002      Bob  30.0      0.0
2        1003  Charlie   0.0  70000.0
3       10044    David  27.0  60000.0

In [87]:
#filling a column with a specific value 
df['Age'].fillna(df['Age'].mean(),inplace=True)
df['Age'] = df['Age'].astype(int)
df

   CustomerID     Name  Age   Income
0        1001    Alice   25  50000.0
1        1002      Bob   30      NaN
2        1003  Charlie   27  70000.0
3       10044    David   27  60000.0

In [88]:
#this replaces missign age and income values with the average age/income
df.fillna({'Age': df['Age'].mean(), 'Income': df['Income'].median()}, inplace=True)
df

   CustomerID     Name  Age   Income
0        1001    Alice   25  50000.0
1        1002      Bob   30  60000.0
2        1003  Charlie   27  70000.0
3       10044    David   27  60000.0

In [89]:
data = {
    'CustomerID': [1001,1002,1003,10044],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, None, 27], 
    'Income': [50000, None, 70000, 60000]
}
df = DataFrame(data)
df

   CustomerID     Name   Age   Income
0        1001    Alice  25.0  50000.0
1        1002      Bob  30.0      NaN
2        1003  Charlie   NaN  70000.0
3       10044    David  27.0  60000.0

In [90]:
df.dropna()

   CustomerID   Name   Age   Income
0        1001  Alice  25.0  50000.0
3       10044  David  27.0  60000.0

In [91]:
df.dropna(subset=['Age', 'Name'])

   CustomerID   Name   Age   Income
0        1001  Alice  25.0  50000.0
1        1002    Bob  30.0      NaN
3       10044  David  27.0  60000.0

In [92]:
#value counts
data = {
    'Qu1': [10,30,40,30,40],
    'Qu2': [20,30,10,20,30],
    'Qu3': [10,50,20,40,50],
}

df=DataFrame(data, index=['a','b','c','d','e'])
df

   Qu1  Qu2  Qu3
a   10   20   10
b   30   30   50
c   40   10   20
d   30   20   40
e   40   30   50

In [93]:
df['Qu1'].value_counts()

30    2
40    2
10    1
Name: Qu1, dtype: int64

In [94]:
df['Qu2'].value_counts()

30    2
20    2
10    1
Name: Qu2, dtype: int64

In [95]:
df.loc['a'].value_counts()

10    2
20    1
Name: a, dtype: int64

In [96]:
df.loc['d'].value_counts()

30    1
40    1
20    1
Name: d, dtype: int64

In [97]:
df.apply(pd.value_counts)

    Qu1  Qu2  Qu3
10  1.0  1.0  1.0
20  NaN  2.0  1.0
30  2.0  2.0  NaN
40  2.0  NaN  1.0
50  NaN  NaN  2.0

In [98]:
df.apply(pd.value_counts).fillna(0)

    Qu1  Qu2  Qu3
10  1.0  1.0  1.0
20  0.0  2.0  1.0
30  2.0  2.0  0.0
40  2.0  0.0  1.0
50  0.0  0.0  2.0

In [99]:
rs=df.apply(pd.value_counts).fillna(0).astype(int)

In [100]:
rs

    Qu1  Qu2  Qu3
10    1    1    1
20    0    2    1
30    2    2    0
40    2    0    1
50    0    0    2

In [101]:
df

   Qu1  Qu2  Qu3
a   10   20   10
b   30   30   50
c   40   10   20
d   30   20   40
e   40   30   50

In [102]:
rs.index.name='values'

In [103]:
rs

        Qu1  Qu2  Qu3
values
10        1    1    1
20        0    2    1
30        2    2    0
40        2    0    1
50        0    0    2

In [104]:
rs.columns.name='counts'
rs

counts  Qu1  Qu2  Qu3
values
10        1    1    1
20        0    2    1
30        2    2    0
40        2    0    1
50        0    0    2

In [105]:
#sample data
data = {
    'Order ID': [1001,2001,3001,4001,5001],
    'Product': ['T-shirt', 'hoodie', 'T-shirt', 'mug', 'hoodie']
}
df = DataFrame(data)
df

   Order ID  Product
0      1001  T-shirt
1      2001   hoodie
2      3001  T-shirt
3      4001      mug
4      5001   hoodie

In [106]:
# count the ocurences of each product
df['Product'].value_counts()

T-shirt    2
hoodie     2
mug        1
Name: Product, dtype: int64